Revit 2027 API
BuiltInFailures.GeneralFailures.UnresolvableErrorInFamily Property
 An error occurred in family "[Name]" that cannot be automatically resolved.\nError Information:\n"[Text]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnresolvableErrorInFamily { get; }
Public Shared ReadOnly Property UnresolvableErrorInFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnresolvableErrorInFamily {
	FailureDefinitionId^ get ();
}
static member UnresolvableErrorInFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace